# ---------------------------------------------------------------------------
# 사용자 정의 클래스
# ---------------------------------------------------------------------------
# 클래스정의 : 밤하늘의 별을 저장하는 데이터
# 클래스이름 : Star
# 클래스속성 : 크기, 색상, 밝기 => 속성(attribute), 필드(field) => 변수
# 클래스기능 : 반짝거린다. 떨어진다 => 함수(function), 메서드(method) => 함수
# ---------------------------------------------------------------------------
class Star:
    pass

# ---------------------------------------------------------------------------
# 객체 생성 => 클래스에 정의된 속성 즉 변수와 함수들이 메모리 힙영역에 생성
# 생성 방법 => 클래스명() 생성자 함수/메서드
#             클래스명(매개변수1) 생성자 함수/메서드
#             클래스명(매개변수1, 매개변수2, ... 매개변수 N) 생성자 함수/메서드
# ---------------------------------------------------------------------------
myStar=Star()
name="Hong"
name.